// Упражнениe 1 Создайте объект вида { a: 1, b: 2, c: 3 }. Напишите функцию, которая выводит в консоль ключи и значения объекта в формате “${key - value}”

// Упражнениe 2 Реализуйте функцию, которая принимает объект и выводит на экран все собственные свойства объекта


// Упражнениe 3 Пусть даны 3 массива. Создайте коллекцию Map, сделайте ключами коллекции эти массивы, а значениями - какие-нибудь строки.


// Упражнениe 4 Пусть дана коллекция Map. С помощью метода keys получите массив ее ключей и переберите его циклом for-of.


// Упражнениe 5 Создайте пустую коллекцию Set. С помощью метода add добавьте в нее элементы со значениями 1, 2 и 3.


// Упражнениe 6 Создайте коллекцию Set с начальными значениями 1,2,3. С помощью метода has проверьте наличие элемента со значением 3, а затем элемента со значением 4.


// Упражнениe 7 Пусть дан массив. С помощью Set получите этот же массив, но без дублирующихся элементов


// Упражнениe 8 Создайте объект Map в который запишите названия дней недели на русском языке в качестве значений и соответствующие им названия дней недели на английском в качестве ключей