//Упражнение 1 Создайте кнопку счётчик-кликов.

//Упражнение 2 Напишите “длинную страницу”, которая отображает на экране текущую длину прокрутки


//Упражнение 3 Дата таблица с числами. По нажатию на ячейку в неё должен заноситься квадрат числа, которое она содержит


//Упражнение 4 Сделайте таблицу 5x5. Используя делегирование событий окрашивать красным цветом фон той ячейки, над которой в данный момент зависает курсор


//Упражнение 5 Сделать простейшую валидацию: создать инпут, при расфокусе которого будет проверяться соответствие value input’а какой-либо строке


//Упражнение 6 Реализовать делегирование события фокус от элемента формы к инпутам: при фокусе граница инпута должна менять цвет и ширину


//Упражнение 7 Создайте кнопку, которая удаляет себя со страницы по нажатию на неё


//Упражнение 8 Создайте список ol с несколькими элементами li. По нажатию на каждый элемент списка этот элемент должен удаляться