// Упражнение 1 Добавьте на страницу элемент div, установите ему класс container. Найдите этот элемент в DOM по классу как посредством getElementsByClassName. так и с помощью querySelector. Повторите тот же процесс но установив другой элемент div с атрибутом id равным main_containter


// Упражнение 2 Создать div и стилизовать его динамически в js коде. Для этого:
// a) Используйте свойство className
// b) Используйте свойство classList
// c)Установив id элемента


// Упражнение 3 Создайте div с заданной шириной и измените ему стили используя свойство style. Чем этот способ отличается от стилизации с помощью установки классов и id?


// Упражнение 4 Создайте список из 10 элементов и в JavaScript коде измените стиль каждого второго элемента таким образом, чтобы текст элемента стал жирным, а цвет фона серым


// Упражнение 5 Реализуйте функцию, которая в качестве параметра принимает id инпута и возвращает значение в этом input’е


// Упражнение 6 Реализуйте функцию, которая делает input с переданным в неё классом неактивным


// Упражнение 7 Добавьте элементу div в качестве потомков два элемента span с произвольным текстовым содержимым


// Упражнение 8 Реализуйте функцию, которая в качестве параметров принимает id элемента и строку, которую устанавливает в качестве текста в этом элементе. Для реализации используйте:
// a) Свойство элемента textContent
// b) Свойство элемента innerHTML


// Упражнение 9 Дан элемент. Найдите его первого потомка и сделайте его текст красного цвета.

// Упражнение 10 Дано три элемента. Найдите для первого элемента соседа снизу его соседа снизу (следующий элемент за соседним) и добавьте ему в конец текст '!!!'.